app/controllers/api/about_us_controller.rb

SELECT "about_us".* FROM "about_us"
---
    def index
        slides = AboutU.all