app/controllers/api/client_messages_controller.rb

SELECT "client_messages".* FROM "client_messages"
---
    def index
        messages = ClientMessage.all

INSERT INTO "client_messages" ("full_name", "professional_email", "their_message", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["full_name", ""], ["professional_email", ""], ["their_message", ""], ["created_at", "2022-10-10 16:36:53.723505"], ["updated_at", "2022-10-10 16:36:53.723505"]]
---
    def create
        if current_user
            user = ClientMessage.create!(cm_params)