app/controllers/api/community_impacts_controller.rb

SELECT "community_impacts".* FROM "community_impacts"
---
    def index
        slides = CommunityImpact.all

SELECT "community_impacts".* FROM "community_impacts" WHERE "community_impacts"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
---
    def show
        slide = CommunityImpact.find_by!(id: params[:id])