app/controllers/api/login_page_slides_controller.rb

    def index
        slides = LoginPageSlide.all
---
SELECT "login_page_slides".* FROM "login_page_slides"