app/controllers/api/major_generals_controller.rb

SELECT "major_generals".* FROM "major_generals"
---
    def index
        slides = MajorGeneral.all

SELECT "major_generals".* FROM "major_generals" WHERE "major_generals"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
    def show
        slide = MajorGeneral.find_by!(id: params[:id])