app/controllers/api/memorials_controller.rb

    def index
        slides = Memorial.all
---
SELECT "memorials".* FROM "memorials"