app/controllers/api/one_user_profiles_controller.rb

SELECT "one_user_profiles".* FROM "one_user_profiles" WHERE "one_user_profiles"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        user = OneUserProfile.find_by(id: params[:id])

UPDATE "one_user_profiles" SET "full_name" = $1, "gender" = $2, "bio" = $3, "interests" = $4, "image_upload" = $5, "favourite_military_branch" = $6, "updated_at" = $7 WHERE "one_user_profiles"."id" = $8  [["full_name", ""], ["gender", ""], ["bio", "Lorem is loreming"], ["interests", ""], ["image_upload", ""], ["favourite_military_branch", ""], ["updated_at", "2022-10-11 19:40:25.351132"], ["id", 2]]
---
    def update
        user = current_user.one_user_profile.update!(update_params)