app/controllers/api/platoons_controller.rb

    def index
        slides = Platoon.all
---
SELECT "platoons".* FROM "platoons"