app/controllers/api/soldiers_controller.rb

    def index
        slides = Soldier.all
---
SELECT "soldiers".* FROM "soldiers"

    def show
        slide = Soldier.find_by!(id: params[:id])
---
SELECT "soldiers".* FROM "soldiers" WHERE "soldiers"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]