app/controllers/api/technologies_controller.rb

    def index
        slides = Technology.all
---
SELECT "technologies".* FROM "technologies"

    def show
        slide = Technology.find_by!(id: params[:id])
---
SELECT "technologies".* FROM "technologies" WHERE "technologies"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]