app/controllers/api/user_comments_controller.rb

    def index
        slides = @current_user.user_comments.all
---
SELECT "user_comments".* FROM "user_comments"

    def create
        slide = @current_user.user_comments.create!(uc_params)
---
INSERT INTO "user_comments" ("full_name", "image_upload", "user_comment", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

    def destroy
        slide = find_comment
        find_comment.destroy!
---
DELETE FROM "user_comments" WHERE "user_comments"."id" = $1  [["id", 2]]

    def find_comment
        UserComment.find_by!(id: session[:user_id])
---
SELECT "user_comments".* FROM "user_comments" WHERE "user_comments"."id" = $1 LIMIT $2  [["id", 16], ["LIMIT", 1]]