app/controllers/api/user_profiles_controller.rb

    def index
        slides = UserProfile.all
---
SELECT "user_profiles".* FROM "user_profiles" WHERE "user_profiles"."user_id" = $1 LIMIT $2  [["user_id", 13], ["LIMIT", 1]]

    def show
        slide = UserProfile.find_by!(id: params[:id])
---
SELECT "user_profiles".* FROM "user_profiles" WHERE "user_profiles"."user_id" = $1 LIMIT $2  [["user_id", 14], ["LIMIT", 1]]