app/controllers/api/users_controller.rb

    def create
        @user = User.create!(user_params)
---
INSERT INTO "users" ("full_name", "email", "password_digest", "is_admin?", "age", "gender", "bio", "interests", "image_upload", "favourite_military_branch", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"

    def show
        user = User.find_by!(id: session[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]

    def update
            user = @current_user.update!(update_params)
---
UPDATE "users" SET "full_name" = $1, "age" = $2, "gender" = $3, "bio" = $4, "favourite_military_branch" = $5, "updated_at" = $6 WHERE "users"."id" = $7  [["full_name", "Lunox"], ["age", 20], ["gender", "female"], ["bio", "She is a beauty"], ["favourite_military_branch", "Mages"], ["updated_at", "2022-10-10 08:34:21.413980"], ["id", 12]]

    def destroy
        user = @current_user.destroy
---
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 12]]