app/models/user.rb

INSERT INTO "user_profiles" ("id", "full_name", "email", "age", "gender", "bio", "interests", "image_upload", "favourite_military_branch", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"
---
    def profile
        OneUserProfile.create(
          email: self.email,
          user_id: self.id
        )